tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "sschlesier/csvutils"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Interpreter for the AWK Programming Language
brew "mawk"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Collection of macOS command-line utilities
brew "osxutils"
# Shell command parallelization utility
brew "parallel"
# Object-relational database system
brew "postgresql", restart_service: true
# Parse HTML at the command-line
brew "pup"
# Software environment for statistical computing
brew "r"
# GNU's Restricted User SHell
brew "rush"
# Soak up standard input and write to a file
brew "sponge"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Online learning algorithm
brew "vowpal-wabbit"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Process YAML documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Minimal installer for conda
cask "miniconda"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
