tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "sschlesier/csvutils"
# Ammonite is a cleanroom re-implementation of the Scala REPL
brew "ammonite-repl"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc", link: false
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# GNU database manager
brew "gdbm"
# Library for command-line editing
brew "readline"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Decode and encode messages in the GRIB 1/2 and BUFR 3/4 formats
brew "eccodes"
# Climate Data Operators
brew "cdo"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern replacement for 'ls'
brew "exa"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU awk utility
brew "gawk"
# Geometry Engine
brew "geos"
# Framework for scientific data networking
brew "libdap"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Package for scientific computing with Python
brew "numpy", link: false
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# ID3 tag manipulation
brew "id3lib"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython", link: false
# Just Another Gibbs Sampler for Bayesian MCMC simulation
brew "jags"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# Utility for directing compilation
brew "make"
# Interpreter for the AWK Programming Language
brew "mawk"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# High-level interpreted language for numerical computing
brew "octave"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@8"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Parse HTML at the command-line
brew "pup"
# Python version management
brew "pyenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# GNU's Restricted User SHell
brew "rush"
# Build tool for Scala projects
brew "sbt"
# ODBC driver for SQLite
brew "sqliteodbc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8"
# Online learning algorithm
brew "vowpal-wabbit"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Fast CSV toolkit written in Rust
brew "xsv"
# Process YAML documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Smart and simple CSV processing on the command-line
brew "sschlesier/csvutils/csvquote"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Programming language for technical computing
cask "julia"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Environment for statistical computing and graphics
cask "r"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Open-source version of the X.Org X Window System
cask "xquartz"
